---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.HoleDefinitionService
source: html/e58d2019-340e-a195-16dd-70338bf2a9fa.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.HoleDefinitionService Property

The external service to view and modify hole definition parameters.

## Syntax (C#)
```csharp
public static ExternalServiceId HoleDefinitionService { get; }
```